---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofExceedsMaxHeight
source: html/7d921641-763b-6e3b-3063-fffe91023797.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofExceedsMaxHeight Property

Roof exceeds user-specified maximum height

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofExceedsMaxHeight { get; }
```